In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import statsmodels.formula.api as smf
import sklearn.metrics
from sklearn.metrics import confusion_matrix, accuracy_score
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('~/Downloads/home-credit-default-risk/application_train.csv')

In [3]:
df['age']= (df['DAYS_BIRTH']/-365).round(0)

In [4]:
df.columns.tolist()

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'CODE_GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'AMT_CREDIT',
 'AMT_ANNUITY',
 'AMT_GOODS_PRICE',
 'NAME_TYPE_SUITE',
 'NAME_INCOME_TYPE',
 'NAME_EDUCATION_TYPE',
 'NAME_FAMILY_STATUS',
 'NAME_HOUSING_TYPE',
 'REGION_POPULATION_RELATIVE',
 'DAYS_BIRTH',
 'DAYS_EMPLOYED',
 'DAYS_REGISTRATION',
 'DAYS_ID_PUBLISH',
 'OWN_CAR_AGE',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL',
 'OCCUPATION_TYPE',
 'CNT_FAM_MEMBERS',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'WEEKDAY_APPR_PROCESS_START',
 'HOUR_APPR_PROCESS_START',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'ORGANIZATION_TYPE',
 'EXT_SOURCE_1',
 'EXT_SOURCE_2',
 'EXT_SOURCE_3',
 'APARTMENTS_AVG',
 'BASEMENTAREA_AVG',
 'YEARS_BEGINEXPLUATATION_AVG',
 'YEARS_BUILD_AVG',
 'COMMONAREA_AVG',
 'ELEVATORS_AVG',
 'ENTRANCES_AVG',
 'FLOORSMAX_AVG',
 'FLOORSMIN_AVG',
 'LANDAREA_AVG',
 'LIVINGAPARTMENTS_AVG',
 'LIVINGAREA_AVG',
 'NONLIVINGAPARTMENTS_AVG',
 'NONLIVINGAREA_AVG',
 'APARTMENTS_MODE',
 'BASEMENTAREA_MODE',
 'YEARS_BEGINEXPLUATATION_MODE',
 'YEARS_BUILD_MODE',
 'COMMONAREA_MODE',
 'ELEVATORS_MODE',
 'ENTRANCES_MODE',
 'FLOORSMAX_MODE',
 'FLOORSMIN_MODE',
 'LANDAREA_MODE',
 'LIVINGAPARTMENTS_MODE',
 'LIVINGAREA_MODE',
 'NONLIVINGAPARTMENTS_MODE',
 'NONLIVINGAREA_MODE',
 'APARTMENTS_MEDI',
 'BASEMENTAREA_MEDI',
 'YEARS_BEGINEXPLUATATION_MEDI',
 'YEARS_BUILD_MEDI',
 'COMMONAREA_MEDI',
 'ELEVATORS_MEDI',
 'ENTRANCES_MEDI',
 'FLOORSMAX_MEDI',
 'FLOORSMIN_MEDI',
 'LANDAREA_MEDI',
 'LIVINGAPARTMENTS_MEDI',
 'LIVINGAREA_MEDI',
 'NONLIVINGAPARTMENTS_MEDI',
 'NONLIVINGAREA_MEDI',
 'FONDKAPREMONT_MODE',
 'HOUSETYPE_MODE',
 'TOTALAREA_MODE',
 'WALLSMATERIAL_MODE',
 'EMERGENCYSTATE_MODE',
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'DAYS_LAST_PHONE_CHANGE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR',
 'age']

In [5]:
df.drop(['NAME_CONTRACT_TYPE','FLAG_OWN_REALTY',
 'CNT_CHILDREN','REGION_POPULATION_RELATIVE',
 'DAYS_EMPLOYED',
 'DAYS_REGISTRATION',
 'DAYS_ID_PUBLISH','OWN_CAR_AGE',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL','CNT_FAM_MEMBERS',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'WEEKDAY_APPR_PROCESS_START',
 'HOUR_APPR_PROCESS_START',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'ORGANIZATION_TYPE',
 'EXT_SOURCE_1',
 'EXT_SOURCE_2',
 'EXT_SOURCE_3',
 'APARTMENTS_AVG',
 'BASEMENTAREA_AVG',
 'YEARS_BEGINEXPLUATATION_AVG',
 'YEARS_BUILD_AVG',
 'COMMONAREA_AVG',
 'ELEVATORS_AVG',
 'ENTRANCES_AVG',
 'FLOORSMAX_AVG',
 'FLOORSMIN_AVG',
 'LANDAREA_AVG',
 'LIVINGAPARTMENTS_AVG',
 'LIVINGAREA_AVG',
 'NONLIVINGAPARTMENTS_AVG',
 'NONLIVINGAREA_AVG',
 'APARTMENTS_MODE',
 'BASEMENTAREA_MODE',
 'YEARS_BEGINEXPLUATATION_MODE',
 'YEARS_BUILD_MODE',
 'COMMONAREA_MODE',
 'ELEVATORS_MODE',
 'ENTRANCES_MODE',
 'FLOORSMAX_MODE',
 'FLOORSMIN_MODE',
 'LANDAREA_MODE',
 'LIVINGAPARTMENTS_MODE',
 'LIVINGAREA_MODE',
 'NONLIVINGAPARTMENTS_MODE',
 'NONLIVINGAREA_MODE',
 'APARTMENTS_MEDI',
 'BASEMENTAREA_MEDI',
 'YEARS_BEGINEXPLUATATION_MEDI',
 'YEARS_BUILD_MEDI',
 'COMMONAREA_MEDI',
 'ELEVATORS_MEDI',
 'ENTRANCES_MEDI',
 'FLOORSMAX_MEDI',
 'FLOORSMIN_MEDI',
 'LANDAREA_MEDI',
 'LIVINGAPARTMENTS_MEDI',
 'LIVINGAREA_MEDI',
 'NONLIVINGAPARTMENTS_MEDI',
 'NONLIVINGAREA_MEDI',
 'FONDKAPREMONT_MODE',
 'HOUSETYPE_MODE',
 'TOTALAREA_MODE',
 'WALLSMATERIAL_MODE',
 'EMERGENCYSTATE_MODE',
 'OBS_30_CNT_SOCIAL_CIRCLE',
 'DEF_30_CNT_SOCIAL_CIRCLE',
 'OBS_60_CNT_SOCIAL_CIRCLE',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'DAYS_LAST_PHONE_CHANGE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK',
 'AMT_REQ_CREDIT_BUREAU_MON',
 'AMT_REQ_CREDIT_BUREAU_QRT',
 'AMT_REQ_CREDIT_BUREAU_YEAR','OCCUPATION_TYPE','NAME_FAMILY_STATUS','NAME_TYPE_SUITE','AMT_CREDIT','AMT_ANNUITY','AMT_GOODS_PRICE','DAYS_BIRTH'
        ], axis = 1, inplace=True)

In [6]:
df[df['CODE_GENDER']=='XNA']
df.drop(df.index[[35657,38566,83382,189640]],inplace=True)

In [7]:
df.shape

(307507, 9)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 307507 entries, 0 to 307510
Data columns (total 9 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   SK_ID_CURR           307507 non-null  int64
 1   TARGET               307507 non-null  int64
 2   CODE_GENDER          307507 non-null  object
 3   FLAG_OWN_CAR         307507 non-null  object
 4   AMT_INCOME_TOTAL     307507 non-null  float64
 5   NAME_INCOME_TYPE     307507 non-null  object
 6   NAME_EDUCATION_TYPE  307507 non-null  object
 7   NAME_HOUSING_TYPE    307507 non-null  object
 8   age                  307507 non-null  float64
dtypes: float64(2), int64(2), object(5)
memory usage: 23.5+ MB

In [11]:
dfn=df[df['TARGET']==0]
dfn

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
1,100003,0,F,N,270000.0,State servant,Higher education,House / apartment,46.0
2,100004,0,M,Y,67500.0,Working,Secondary / secondary special,House / apartment,52.0
3,100006,0,F,N,135000.0,Working,Secondary / secondary special,House / apartment,52.0
4,100007,0,M,N,121500.0,Working,Secondary / secondary special,House / apartment,55.0
5,100008,0,M,N,99000.0,State servant,Secondary / secondary special,House / apartment,46.0
...,...,...,...,...,...,...,...,...,...
307505,456249,0,F,N,112500.0,Pensioner,Secondary / secondary special,House / apartment,67.0
307506,456251,0,M,N,157500.0,Working,Secondary / secondary special,With parents,26.0
307507,456252,0,F,N,72000.0,Pensioner,Secondary / secondary special,House / apartment,57.0
307508,456253,0,F,N,153000.0,Working,Higher education,House / apartment,41.0
307510,456255,0,F,N,157500.0,Commercial associate,Higher education,House / apartment,46.0

In [14]:
df1=dfn.sample(n=90000)

In [15]:
df1

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
284462,429438,0,F,N,76500.0,State servant,Secondary / secondary special,House / apartment,42.0
116689,235320,0,F,Y,189000.0,Commercial associate,Higher education,House / apartment,44.0
3656,104264,0,F,Y,720000.0,Commercial associate,Higher education,House / apartment,40.0
62972,173044,0,F,N,121500.0,Working,Higher education,House / apartment,44.0
96860,212442,0,M,Y,225000.0,Working,Higher education,House / apartment,41.0
...,...,...,...,...,...,...,...,...,...
279683,424039,0,F,N,112500.0,Working,Secondary / secondary special,House / apartment,29.0
246448,385238,0,F,N,202500.0,Pensioner,Secondary / secondary special,House / apartment,63.0
50836,158871,0,F,N,81000.0,Commercial associate,Secondary / secondary special,House / apartment,46.0
297241,444368,0,F,N,180000.0,Commercial associate,Higher education,House / apartment,44.0
169230,296146,0,F,N,94500.0,Pensioner,Secondary / secondary special,House / apartment,67.0

In [17]:
df2=df[df['TARGET']==1]

In [18]:
df2

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
0,100002,1,M,N,202500.0,Working,Secondary / secondary special,House / apartment,26.0
26,100031,1,F,N,112500.0,Working,Secondary / secondary special,House / apartment,51.0
40,100047,1,M,N,202500.0,Commercial associate,Secondary / secondary special,House / apartment,48.0
42,100049,1,F,N,135000.0,Working,Secondary / secondary special,House / apartment,37.0
81,100096,1,F,N,81000.0,Pensioner,Secondary / secondary special,House / apartment,68.0
...,...,...,...,...,...,...,...,...,...
307448,456186,1,M,N,207000.0,Working,Secondary / secondary special,House / apartment,27.0
307475,456215,1,F,N,144000.0,Working,Higher education,House / apartment,37.0
307481,456225,1,M,N,225000.0,Working,Secondary / secondary special,House / apartment,57.0
307489,456233,1,F,N,225000.0,Commercial associate,Secondary / secondary special,House / apartment,45.0
307509,456254,1,F,N,171000.0,Commercial associate,Secondary / secondary special,House / apartment,33.0

In [22]:
df3 = df1.append(df2)

In [23]:
df3

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
284462,429438,0,F,N,76500.0,State servant,Secondary / secondary special,House / apartment,42.0
116689,235320,0,F,Y,189000.0,Commercial associate,Higher education,House / apartment,44.0
3656,104264,0,F,Y,720000.0,Commercial associate,Higher education,House / apartment,40.0
62972,173044,0,F,N,121500.0,Working,Higher education,House / apartment,44.0
96860,212442,0,M,Y,225000.0,Working,Higher education,House / apartment,41.0
...,...,...,...,...,...,...,...,...,...
307448,456186,1,M,N,207000.0,Working,Secondary / secondary special,House / apartment,27.0
307475,456215,1,F,N,144000.0,Working,Higher education,House / apartment,37.0
307481,456225,1,M,N,225000.0,Working,Secondary / secondary special,House / apartment,57.0
307489,456233,1,F,N,225000.0,Commercial associate,Secondary / secondary special,House / apartment,45.0
307509,456254,1,F,N,171000.0,Commercial associate,Secondary / secondary special,House / apartment,33.0

In [25]:
df3[df3['TARGET']==1]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
0,100002,1,M,N,202500.0,Working,Secondary / secondary special,House / apartment,26.0
26,100031,1,F,N,112500.0,Working,Secondary / secondary special,House / apartment,51.0
40,100047,1,M,N,202500.0,Commercial associate,Secondary / secondary special,House / apartment,48.0
42,100049,1,F,N,135000.0,Working,Secondary / secondary special,House / apartment,37.0
81,100096,1,F,N,81000.0,Pensioner,Secondary / secondary special,House / apartment,68.0
...,...,...,...,...,...,...,...,...,...
307448,456186,1,M,N,207000.0,Working,Secondary / secondary special,House / apartment,27.0
307475,456215,1,F,N,144000.0,Working,Higher education,House / apartment,37.0
307481,456225,1,M,N,225000.0,Working,Secondary / secondary special,House / apartment,57.0
307489,456233,1,F,N,225000.0,Commercial associate,Secondary / secondary special,House / apartment,45.0
307509,456254,1,F,N,171000.0,Commercial associate,Secondary / secondary special,House / apartment,33.0

In [26]:
df3[df3['TARGET']==0]

,SK_ID_CURR,TARGET,CODE_GENDER,FLAG_OWN_CAR,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_HOUSING_TYPE,age
284462,429438,0,F,N,76500.0,State servant,Secondary / secondary special,House / apartment,42.0
116689,235320,0,F,Y,189000.0,Commercial associate,Higher education,House / apartment,44.0
3656,104264,0,F,Y,720000.0,Commercial associate,Higher education,House / apartment,40.0
62972,173044,0,F,N,121500.0,Working,Higher education,House / apartment,44.0
96860,212442,0,M,Y,225000.0,Working,Higher education,House / apartment,41.0
...,...,...,...,...,...,...,...,...,...
279683,424039,0,F,N,112500.0,Working,Secondary / secondary special,House / apartment,29.0
246448,385238,0,F,N,202500.0,Pensioner,Secondary / secondary special,House / apartment,63.0
50836,158871,0,F,N,81000.0,Commercial associate,Secondary / secondary special,House / apartment,46.0
297241,444368,0,F,N,180000.0,Commercial associate,Higher education,House / apartment,44.0
169230,296146,0,F,N,94500.0,Pensioner,Secondary / secondary special,House / apartment,67.0

In [27]:
def statsmodels_train_test_split(df, stratify=None, **kwargs):

    if stratify is None:
        y, X = df.iloc[:,0], df.drop(columns=df.columns[0])
        X_train, X_test, y_train, y_test = train_test_split(X,y, **kwargs)
    else:
        y, X = stratify, df.drop(columns = stratify.name)
        X_train, X_test, y_train, y_test = train_test_split(X,y,stratify=y, **kwargs)
    
    return pd.concat([X_train, y_train], axis=1), pd.concat([X_test, y_test], axis=1)

In [28]:
train, test = statsmodels_train_test_split(df3)

In [29]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86118 entries, 187147 to 153361
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   TARGET               86118 non-null  int64
 1   CODE_GENDER          86118 non-null  object
 2   FLAG_OWN_CAR         86118 non-null  object
 3   AMT_INCOME_TOTAL     86118 non-null  float64
 4   NAME_INCOME_TYPE     86118 non-null  object
 5   NAME_EDUCATION_TYPE  86118 non-null  object
 6   NAME_HOUSING_TYPE    86118 non-null  object
 7   age                  86118 non-null  float64
 8   SK_ID_CURR           86118 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 6.6+ MB

In [30]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 28707 entries, 60757 to 239555
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   TARGET               28707 non-null  int64
 1   CODE_GENDER          28707 non-null  object
 2   FLAG_OWN_CAR         28707 non-null  object
 3   AMT_INCOME_TOTAL     28707 non-null  float64
 4   NAME_INCOME_TYPE     28707 non-null  object
 5   NAME_EDUCATION_TYPE  28707 non-null  object
 6   NAME_HOUSING_TYPE    28707 non-null  object
 7   age                  28707 non-null  float64
 8   SK_ID_CURR           28707 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 2.2+ MB

In [31]:
train['TARGET'].value_counts()

0    67586
1    18532
Name: TARGET, dtype: int64

In [33]:
fitted_model = smf.logit(formula='TARGET ~ C(CODE_GENDER)+C(FLAG_OWN_CAR)+age+AMT_INCOME_TOTAL', data=train).fit(method='ncg')
fitted_model.summary()

Optimization terminated successfully.
         Current function value: 0.650316
         Iterations: 1
         Function evaluations: 2
         Gradient evaluations: 2
         Hessian evaluations: 1

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:                 TARGET   No. Observations:                86118
Model:                          Logit   Df Residuals:                    86113
Method:                           MLE   Df Model:                            4
Date:                Sat, 26 Sep 2020   Pseudo R-squ.:                 -0.2488
Time:                        23:37:43   Log-Likelihood:                -56004.
converged:                       True   LL-Null:                       -44846.
Covariance Type:            nonrobust   LLR p-value:                     1.000
========================================================================================
                           coef    std err          z      P>|z|      [0.025      0.975]
----------------------------------------------------------------------------------------
Intercept            -5.806e-12      0.030  -1.92e-10      1.000      -0.059       0.059
C(CODE_GENDER)[T.M]  -1.729e-12      0.015  -1.12e-10      1.000      -0.030       0.030
C(FLAG_OWN_CAR)[T.Y] -2.069e-12      0.016  -1.32e-10      1.000      -0.031       0.031
age                   -2.64e-10      0.001  -4.54e-07      1.000      -0.001       0.001
AMT_INCOME_TOTAL     -9.893e-07   7.74e-08    -12.783      0.000   -1.14e-06   -8.38e-07
========================================================================================
"""

In [34]:
fitted_model.pred_table()

array([[67586.,     0.],
       [18532.,     0.]])